In [1]:
import pandas as pd

# Series

In [2]:
cars = pd.Series(['BMW', 'Toyota', 'Hyundai'])

In [3]:
colors = pd.Series(['Blue','Red','White'])

Series are a 1-dimensional array

# DataFrane
It's 2-dimensional array

![](images/pandas-anatomy-of-a-dataframe.png)

In [4]:
car_data = pd.DataFrame({
    "Car make": cars,
    "Color": colors
})

In [5]:
car_data

  Car make  Color
0      BMW   Blue
1   Toyota    Red
2  Hyundai  White

# Import Data

In [6]:
car_sales = pd.read_csv("data/car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [7]:
# Data from URLs
heart_disease = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/heart-disease.csv")
heart_disease.head(10)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
5,57,1,0,140,192,0,1,148,0,0.4,1,0,1,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
7,44,1,1,120,263,0,1,173,0,0.0,2,0,3,1
8,52,1,2,172,199,1,1,162,0,0.5,2,0,3,1
9,57,1,2,150,168,0,1,174,0,1.6,2,0,2,1

# Exporting DataFrame

In [8]:
car_sales.to_csv("export/exported_car_sales.csv", index=False) # Avoid exporting the Index, so that we don't have double index.

# Describe data

In [9]:
# Attribute
car_sales.dtypes
# Function
# car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [10]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [11]:
car_columns = car_sales.columns

In [12]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [13]:
# Give us statistical information about it
car_sales.describe()
# notice how 'price' does not exist. it's a string not a numerical value. possible export errors

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [14]:
car_sales.info() # kinda like index and dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [15]:
car_sales.mean(numeric_only=True) # numeric_only=true is required because it'd try to get the mean of strings

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [16]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [17]:
car_sales["Doors"].sum()
# Displays np.int64(x) because we haven't imported numpy

np.int64(40)

In [18]:
len(car_sales)

10